deepfake_ws_test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Deepfake Detector WS TestPlan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Users as WS Clients" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">10</stringProp>
        <stringProp name="ThreadGroup.ramp_time">10</stringProp>
        <longProp name="ThreadGroup.start_time">1720000000000</longProp>
        <longProp name="ThreadGroup.end_time">1720000000000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="Frames CSV" enabled="true">
          <stringProp name="delimiter">,</stringProp>
          <stringProp name="filename">/mnt/data/frames.csv</stringProp>
          <boolProp name="ignoreFirstLine">true</boolProp>
          <boolProp name="quotedData">false</boolProp>
          <boolProp name="recycle">true</boolProp>
          <boolProp name="stopThread">false</boolProp>
          <stringProp name="variableNames">meeting_id,user_id,frame_index,hex_data</stringProp>
          <stringProp name="shareMode">shareMode.all</stringProp>
        </CSVDataSet>
        <hashTree/>

        <kg.apc.jmeter.samplers.WebSocketSampler guiclass="kg.apc.jmeter.samplers.WebSocketSamplerGui" testclass="kg.apc.jmeter.samplers.WebSocketSampler" testname="Open WS Connection" enabled="true">
          <stringProp name="SERVER">localhost</stringProp>
          <stringProp name="PORT">8080</stringProp>
          <stringProp name="PATH">/ws</stringProp>
          <stringProp name="CONNECT_TIMEOUT">5000</stringProp>
          <stringProp name="RESPONSE_TIMEOUT">10000</stringProp>
          <stringProp name="PROTOCOL">wss</stringProp>
          <stringProp name="REQUEST_TYPE">CONNECT</stringProp>
        </kg.apc.jmeter.samplers.WebSocketSampler>
        <hashTree/>

        <LoopController guiclass="LoopControlPanel" testclass="LoopController" testname="Stream Frames Loop" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">-1</stringProp>
        </LoopController>
        <hashTree>
          <kg.apc.jmeter.samplers.WebSocketSampler guiclass="kg.apc.jmeter.samplers.WebSocketSamplerGui" testclass="kg.apc.jmeter.samplers.WebSocketSampler" testname="Send Frame" enabled="true">
            <stringProp name="REQUEST_TYPE">BINARY</stringProp>
            <stringProp name="REQUEST_DATA">${hex_data}</stringProp>
            <stringProp name="SERVER">localhost</stringProp>
            <stringProp name="PORT">8080</stringProp>
            <stringProp name="PATH">/ws</stringProp>
            <stringProp name="PROTOCOL">wss</stringProp>
          </kg.apc.jmeter.samplers.WebSocketSampler>
          <hashTree>
            <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="20ms Timer" enabled="true">
              <stringProp name="ConstantTimer.delay">20</stringProp>
            </ConstantTimer>
            <hashTree/>
          </hashTree>
        </hashTree>

        <kg.apc.jmeter.samplers.WebSocketSampler guiclass="kg.apc.jmeter.samplers.WebSocketSamplerGui" testclass="kg.apc.jmeter.samplers.WebSocketSampler" testname="Close WS Connection" enabled="true">
          <stringProp name="REQUEST_TYPE">DISCONNECT</stringProp>
          <stringProp name="SERVER">localhost</stringProp>
          <stringProp name="PORT">8080</stringProp>
          <stringProp name="PATH">/ws</stringProp>
          <stringProp name="PROTOCOL">wss</stringProp>
        </kg.apc.jmeter.samplers.WebSocketSampler>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>